export const Sounds = {
  Shoot: new Audio('./audio/shoot.wav'),
  Damage: new Audio('./audio/damage.wav'),
  Die: new Audio('./audio/die.wav'),
  Hit: new Audio('./audio/hit.wav'),
  Impulse: new Audio('./audio/impulse'),
};

// геометрия объектов (последовательность вершин без повтора первой в конце)
export const Paths = [
  // ship
  [[0, -1], [0.5, 0.3], [-0.5, 0.3]],
  // ship + fire
  [[0, -1], [0.5, 0.3], [-0.5, 0.3], [-0.2, 0.3], [0, 1], [0.2, 0.3], [-0.5, 0.3]],
  [[-1, -1], [1, -1], [1, 1], [-1, 1]],
  // bullet
  [[0, -0.7], [0.3, -1], [1, -0.3], [0.5, -0.1], [0.7, 0.5], [0.1, 0.9], [-0.7, 1], [-1, 0.7], [-0.8, -0.5], [-0.3, -1]],
  // asteroids
  [[-0.4, -1], [0.5, -1], [1, -0.8], [1, 0.1], [0.5, 1], [0.01, 1], [0, 0.2], [-0.2, 1], [-0.8, 0.2], [-0.5, 0], [-1, -0.1]],
  [[-0.8, -1], [0.1, -1], [1, -0.4], [1, -0.2], [0.5, 0], [1, 0.2], [0.4, 1], [0, 0.6], [-0.5, 1], [-1, 0.2], [-1, -0.5], [-0.4, -0.5]]
];
